---
type: RibbonButtonOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# RibbonButtonOptions

`Autodesk.Revit.UI.RibbonButtonOptions` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |